In [1]:
from sklearn.model_selection import train_test_split

In [2]:
from sklearn.linear_model import LogisticRegression

In [3]:
import pandas as pd

In [4]:
df1 = pd.read_csv("sent_emails.csv")

In [5]:
df2 = pd.read_csv("responded.csv")

In [6]:
df3 = pd.read_csv("userbase.csv")

In [7]:
df1

          Sent_Date  Customer_ID  SubjectLine_ID
0        2016-01-28         1413               2
1        2016-03-02        83889               2
2        2016-03-09       457832               3
3        2016-01-20       127772               1
4        2016-02-03       192123               3
...             ...          ...             ...
2476349  2016-02-22       460565               3
2476350  2016-02-25       360823               2
2476351  2016-03-02       443177               2
2476352  2016-03-12       179200               3
2476353  2016-01-17        68532               2

[2476354 rows x 3 columns]

In [8]:
df2

       Responded_Date  Customer_ID  SubjectLine_ID
0          2016-01-25       217102               3
1          2016-03-26       366875               2
2          2016-03-17       201561               2
3          2016-01-11       395345               3
4          2016-01-11       427539               3
...               ...          ...             ...
378203     2016-01-09        43156               1
378204     2016-03-16       397330               2
378205     2016-02-25       377520               1
378206     2016-02-04       146008               2
378207     2016-02-09       374971               3

[378208 rows x 3 columns]

In [9]:
df3

        Customer_ID Gender Type                   Email_Address  Age  Tenure
0                 1      M    C                     Mph@msn.com   38      12
1                 2      F    B     SophcYN7381qMe8lRqK@aol.com   37      23
2                 3      F    C                      xE@msn.com   32      15
3                 4      M    C             WduR0o0@comcast.net   31      24
4                 5      M    C        walHI9cmWJIBKvy0@aol.com   35      13
...             ...    ...  ...                             ...  ...     ...
499995       499996      M    B              iMt8ckJsdR@msn.com   25      12
499996       499997      F    C      z58KHLR7VtjRZYZh@gmail.com   30       9
499997       499998      M    B  PGqUn8eT9A4lz7geMZ@comcast.net   30      11
499998       499999      M    C              QkI8AH@hotmail.com   33      11
499999       500000      F    B                 7NYSY@yahoo.com   37      13

[500000 rows x 6 columns]

In [10]:
df = pd.concat([df1, df2, df3], axis=1)

In [11]:
df

,Sent_Date,Customer_ID,SubjectLine_ID,Responded_Date,Customer_ID,SubjectLine_ID,Customer_ID,Gender,Type,Email_Address,Age,Tenure
0,2016-01-28,1413,2,2016-01-25,217102.0,3.0,1.0,M,C,Mph@msn.com,38.0,12.0
1,2016-03-02,83889,2,2016-03-26,366875.0,2.0,2.0,F,B,SophcYN7381qMe8lRqK@aol.com,37.0,23.0
2,2016-03-09,457832,3,2016-03-17,201561.0,2.0,3.0,F,C,xE@msn.com,32.0,15.0
3,2016-01-20,127772,1,2016-01-11,395345.0,3.0,4.0,M,C,WduR0o0@comcast.net,31.0,24.0
4,2016-02-03,192123,3,2016-01-11,427539.0,3.0,5.0,M,C,walHI9cmWJIBKvy0@aol.com,35.0,13.0
...,...,...,...,...,...,...,...,...,...,...,...,...
2476349,2016-02-22,460565,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2476350,2016-02-25,360823,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2476351,2016-03-02,443177,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2476352,2016-03-12,179200,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2476353,2016-01-17,68532,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
# add a function to look at sent_date and responded_date and create a new column called one_day_response that is 1 if the response was within 1 day and 0 otherwise
def one_day_response(row):
    if row['Sent_Date'] == row['Responded_Date']:
        return 1
    else:
        return 0
    
df['one_day_response'] = df.apply(one_day_response, axis=1)